system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices
(
    (0 0 0) (0.002 0 0) (0.002 0.001 0) (0 0.001 0)
    (0 0 0.00005) (0.002 0 0.00005) (0.002 0.001 0.00005) (0 0.001 0.00005)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (200 100 1) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet { type patch; faces ( (0 4 7 3) ); }
    outlet { type patch; faces ( (1 5 6 2) ); }
    walls { type wall; faces ( (0 1 5 4) (3 7 6 2) ); }
    frontAndBack { type wall; faces ( (0 3 2 1) (4 5 6 7) ); } // 3D Mesh için
);
mergePatchPairs ();
// ************************************************************************* //
