system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }

castellatedMesh true;
snap            true;
addLayers       false; // Hız için kapalı

geometry
{
    pillars.stl // Python'un üreteceği dosya
    {
        type triSurfaceMesh;
        name pillars;
    }
};

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;
    features ();

    // --- YAMALARI KORUYAN BLOK ---
    refinementSurfaces
    {
        pillars { level (3 3); patchInfo { type wall; } }
        inlet { level (0 0); patchInfo { type patch; } }
        outlet { level (0 0); patchInfo { type patch; } }
        walls { level (0 0); patchInfo { type wall; } }
        frontAndBack { level (0 0); patchInfo { type wall; } }
    }
    // ----------------------------

    resolveFeatureAngle 30;
    
    // Akışkanın olduğu yeri tut, sütunların içini SİL
    refinementRegions
    {
        pillars
        {
            mode inside; // Sütunların İÇİNDEKİ hücreleri sil
            levels ((1E15 1)); 
        }
    }
    
    locationInMesh (0.0001 0.0001 0.000025); // Akışkan noktası
    allowFreeStandingZoneFaces true;
}

snapControls { nSmoothPatch 3; tolerance 2.0; nSolveIter 30; nRelaxIter 5; }
addLayersControls { relativeSizes false; layers {} nGrow 0; }
meshQualityControls { maxNonOrtho 65; maxBoundarySkewness 20; maxInternalSkewness 4; maxConcave 80; minVol 1e-13; minTetQuality 1e-30; minArea -1; minTwist 0.02; minDeterminant 0.001; minFaceWeight 0.05; minVolRatio 0.01; minTriangleTwist -1; nSmoothScale 4; errorReduction 0.75; }
debug 0; mergeTolerance 1e-6;
